[
  {
    "id": 1,
    "name": "Nike Air Max 90",
    "description": "Iconic sneakers from Nike.",
    "image": "../src/assets/products/Nike Air Max 90.avif",
    "category": "Sneakers",
    "brand": "Nike",
    "retailPrice": 300,
    "price": 140,
    "recentlySold": 20,
    "color": "White",
    "releaseDate": "2020",
    "fullDescription": "The Nike Air Max 90, an iconic silhouette that has stood the test of time, represents the epitome of street style and athletic performance. Featuring a sleek design with visible Air cushioning, these sneakers offer both comfort and style. Inspired by the human body's anatomy, the Air Max 90's design elements pay homage to the natural lines and curves of the body, providing a snug and supportive fit. With its classic white colorway and minimalist branding, these shoes are versatile enough to pair with any outfit, whether you're hitting the streets or stepping onto the court. Elevate your sneaker game with the timeless appeal of the Nike Air Max 90.",
    "size": {
      "6": 10,
      "7": 15,
      "8": 20,
      "9": 18,
      "10": 12,
      "11": 8
    }
  },
  {
    "id": 2,
    "name": "Adidas Stan Smith",
    "description": "Classic tennis shoes.",
    "image": "../src/assets/products/stan-smith.avif",
    "category": "Sneakers",
    "brand": "Adidas",
    "retailPrice": 100,
    "price": 80,
    "recentlySold": 120,
    "color": "White",
    "releaseDate": "2023",
    "fullDescription": "The Adidas Stan Smith shoes are a timeless classic, originally designed for the tennis court but now an essential part of streetwear culture. With their clean lines and minimalist design, these sneakers exude effortless style and versatility. The iconic perforated three stripes and contrasting heel tab add subtle detailing, while the durable leather upper ensures long-lasting wear. Inspired by the legendary tennis player Stan Smith, these shoes epitomize the brand's commitment to performance and style. Whether you're on or off the court, the Adidas Stan Smiths are sure to make a statement.",
    "size": {
      "6": 10,
      "7": 15,
      "8": 20,
      "9": 18,
      "10": 12,
      "11": 8
    }
  },
  {
    "id": 3,
    "name": "Gucci Logo T-shirt",
    "description": "Signature logo tee from Gucci.",
    "image": "../src/assets/products/Gucci-Logo-Washed-Print-T-shirt-Black.avif",
    "category": "Apparel",
    "brand": "Gucci",
    "retailPrice": 350,
    "price": 250,
    "recentlySold": 200,
    "color": "Black",
    "releaseDate": "2023",
    "fullDescription": "The Gucci Logo T-shirt is the epitome of luxury and style. Crafted from premium cotton jersey, this tee features the iconic Gucci logo emblazoned across the chest, making a bold statement wherever you go. The classic crew neck and short sleeves offer a comfortable and relaxed fit, perfect for casual outings or layering under your favorite jacket. Inspired by the brand's rich heritage and Italian craftsmanship, this tee combines timeless design with contemporary flair. Elevate your wardrobe with the unmistakable elegance of the Gucci Logo T-shirt.",
    "size": {
      "S": 15,
      "M": 20,
      "L": 18,
      "XL": 12
    }
  },
  {
    "id": 4,
    "name": "Nike Air Force 1",
    "description": "Timeless sneakers for any occasion.",
    "image": "../src/assets/products/Nike Air Force 1.avif",
    "category": "Sneakers",
    "brand": "Nike",
    "retailPrice": 300,
    "price": 100,
    "recentlySold": 400,
    "color": "White",
    "releaseDate": "2022",
    "fullDescription": "The Nike Air Force 1, a true classic in the world of sneakers, continues to reign supreme as a symbol of style and versatility. Originally introduced in 1982, these shoes have stood the test of time and remain as popular as ever. Featuring a premium leather upper and signature Air cushioning in the sole, the Air Force 1 offers unparalleled comfort and support for all-day wear. The iconic silhouette and clean lines make it a staple in any sneaker collection, while the all-white colorway adds a touch of understated elegance. Whether you're hitting the streets or stepping out for a night on the town, the Nike Air Force 1 is the perfect choice for any occasion.",
    "size": {
      "6": 10,
      "7": 15,
      "8": 20,
      "9": 18,
      "10": 12,
      "11": 8
    }
  },
  {
    "id": 5,
    "name": "Adidas Originals Track Jacket",
    "description": "Vintage-inspired track jacket.",
    "image": "../src/assets/products/Palace-Adidas-Firebird-Track-Top-Blue.avif",
    "category": "Apparel",
    "brand": "Adidas",
    "retailPrice": 150,
    "price": 90,
    "recentlySold": 300,
    "color": "Blue",
    "releaseDate": "2023",
    "fullDescription": "The Adidas Originals Track Jacket is a timeless classic that pays homage to the brand's rich heritage and iconic designs. Inspired by vintage sportswear, this jacket features bold color-blocking and the signature Adidas Trefoil logo embroidered on the chest. Made from lightweight polyester tricot, it offers both comfort and style, whether you're hitting the gym or exploring the city streets. The ribbed cuffs and hem provide a snug fit, while the stand-up collar adds a touch of retro flair. Elevate your athleisure game with the Adidas Originals Track Jacket and make a statement wherever you go.",
    "size": {
      "S": 15,
      "M": 20,
      "L": 18,
      "XL": 12
    }
  },
  {
    "id": 6,
    "name": "Louis Vuitton Monogram Belt",
    "description": "Luxurious belt featuring LV monogram.",
    "image": "../src/assets/products/Louis-Vuitton-LV-Initiales-40mm-Reversible-Belt-Brown-Monogram.avif",
    "category": "Accessories",
    "brand": "Louis Vuitton",
    "retailPrice": 400,
    "price": 500,
    "recentlySold": 20,
    "color": "Brown",
    "releaseDate": "2022",
    "fullDescription": "The Louis Vuitton Monogram Belt is a symbol of luxury and sophistication. Crafted from high-quality leather and adorned with the iconic LV monogram canvas, this belt exudes timeless elegance. The classic design features a sleek metal buckle with engraved logo detailing, adding a touch of refinement to any ensemble. Whether worn with jeans or tailored trousers, this belt is sure to elevate your look. Embrace the heritage and craftsmanship of Louis Vuitton with the Monogram Belt and make a statement of understated luxury."
  },
  {
    "id": 7,
    "name": "Nike Tech Fleece Joggers",
    "description": "Comfortable joggers for everyday wear.",
    "image": "../src/assets/products/Nike-Tech-Fleece-Joggers-Grey-v2.avif",
    "category": "Apparel",
    "brand": "Nike",
    "retailPrice": 110,
    "price": 110,
    "recentlySold": 50,
    "color": "Gray",
    "releaseDate": "2022",
    "fullDescription": "The Nike Tech Fleece Joggers combine comfort and style for the ultimate loungewear essential. Made from soft and lightweight Tech Fleece fabric, these joggers offer warmth without the bulk, making them perfect for everyday wear. The tapered fit and ribbed cuffs provide a streamlined look, while the adjustable waistband ensures a customizable fit. Whether you're hitting the gym or running errands, these joggers will keep you looking and feeling your best. Elevate your athleisure game with the Nike Tech Fleece Joggers and experience unparalleled comfort and style.",
    "size": {
      "S": 15,
      "M": 20,
      "L": 18,
      "XL": 12
    }
  },
  {
    "id": 8,
    "name": "Adidas Yeezy Boost 350 V2",
    "description": "Coveted sneakers by Ye.",
    "image": "../src/assets/products/Adidas Yeezy Boost 350 V2.avif",
    "category": "Sneakers",
    "brand": "Adidas",
    "retailPrice": 300,
    "price": 220,
    "recentlySold": 100,
    "color": "Gray",
    "releaseDate": "2023",
    "fullDescription": "The Adidas Yeezy Boost 350 V2, designed in collaboration with Kanye West, is a modern classic that combines cutting-edge design with unrivaled comfort. Featuring Adidas' signature Boost technology in the sole, these sneakers provide responsive cushioning and energy return with every step. The minimalist design is punctuated by the iconic side stripe and 'SPLY-350' branding, creating a sleek and futuristic look. Crafted from premium Primeknit material, the Yeezy Boost 350 V2 offers a snug and supportive fit, perfect for all-day wear. Elevate your sneaker game with the Adidas Yeezy Boost 350 V2 and experience the perfect fusion of style and performance.",
    "size": {
      "6": 10,
      "7": 15,
      "8": 20,
      "9": 18,
      "10": 12,
      "11": 8
    }
  },
  {
    "id": 9,
    "name": "Gucci GG Supreme Backpack",
    "description": "Stylish GG Supreme backpack.",
    "image": "../src/assets/products/Gucci-Messenger-Bag-GG-Supreme-Beige-Brown.avif",
    "category": "Accessories",
    "brand": "Gucci",
    "retailPrice": 1100,
    "price": 1200,
    "recentlySold": 10,
    "color": "Brown",
    "releaseDate": "2022",
    "fullDescription": "The Gucci GG Supreme Backpack is a luxurious accessory that combines style and functionality in equal measure. Crafted from the brand's signature GG Supreme canvas with leather trim, this backpack exudes timeless elegance. The spacious interior is perfect for carrying all your essentials, while the adjustable shoulder straps ensure a comfortable fit. The iconic interlocking GG logo adds a touch of sophistication, making this backpack a statement piece for any outfit. Whether you're traveling or simply running errands, the Gucci GG Supreme Backpack is the ultimate accessory for the modern gentleman."
  },
  {
    "id": 10,
    "name": "Nike Pro Compression Shorts",
    "description": "Performance shorts for intense workouts.",
    "image": "../src/assets/products/Nike-Pro-Elite-Compression-Hyperstrong-Shorts-Black.avif",
    "category": "Apparel",
    "brand": "Nike",
    "retailPrice": 90,
    "price": 45,
    "recentlySold": 200,
    "color": "Black",
    "releaseDate": "2023",
    "fullDescription": "The Nike Pro Compression Shorts are designed to help you perform at your best during intense workouts. Made from lightweight and breathable fabric, these shorts offer a supportive fit and superior comfort, allowing you to move freely without restrictions. The compression fit helps reduce muscle fatigue and speed up recovery time, while the elastic waistband provides a secure fit. Whether you're hitting the gym or pounding the pavement, these shorts are sure to keep you cool and comfortable. Elevate your training routine with the Nike Pro Compression Shorts and unleash your full potential.",
    "size": {
      "S": 15,
      "M": 20,
      "L": 18,
      "XL": 12
    }
  },
  {
    "id": 11,
    "name": "Adidas Originals Superstar",
    "description": "Iconic shell-toe sneakers.",
    "image": "../src/assets/products/Adidas Originals Superstar.avif",
    "category": "Sneakers",
    "brand": "Adidas",
    "retailPrice": 100,
    "price": 100,
    "recentlySold": 400,
    "color": "White",
    "releaseDate": "2020",
    "fullDescription": "The Adidas Originals Superstar sneakers are a true icon of street style and sneaker culture. Featuring the classic shell-toe design and signature three stripes, these shoes have been a symbol of urban cool since their introduction in the 1970s. With a timeless silhouette and durable leather upper, the Superstar offers both style and functionality. The rubber cupsole provides excellent traction and durability, making these sneakers perfect for everyday wear. Whether you're hitting the streets or stepping onto the court, the Adidas Superstar is sure to make a statement.",
    "size": {
      "6": 10,
      "7": 15,
      "8": 20,
      "9": 18,
      "10": 12,
      "11": 8
    }
  },
  {
    "id": 12,
    "name": "Burberry Check Scarf",
    "description": "Classic scarf featuring Burberry check pattern.",
    "image": "../src/assets/products/Burberry-The-Classic-Check-Cashmere-Scarf-Archive-Beige.avif",
    "category": "Accessories",
    "brand": "Burberry",
    "retailPrice": 300,
    "price": 300,
    "recentlySold": 20,
    "color": "Beige",
    "releaseDate": "2023",
    "fullDescription": "The Burberry Check Scarf is a timeless accessory that adds a touch of luxury to any outfit. Crafted from the finest cashmere, this scarf features Burberry's iconic check pattern in a versatile beige colorway. The lightweight fabric makes it perfect for layering, while the fringed edges add a hint of texture. Whether worn draped over the shoulders or knotted around the neck, the Burberry Check Scarf is sure to elevate your cold-weather look. Embrace the heritage and craftsmanship of Burberry with this classic accessory."
  },
  {
    "id": 13,
    "name": "Nike Sportswear Windrunner Jacket",
    "description": "Lightweight jacket.",
    "image": "../src/assets/products/Nike-Sportswear-Windrunner-Canvas-Jacket-Black.avif",
    "category": "Apparel",
    "brand": "Nike",
    "retailPrice": 120,
    "price": 100,
    "recentlySold": 10,
    "color": "Black",
    "releaseDate": "2020",
    "fullDescription": "The Nike Sportswear Windrunner Jacket is a lightweight and versatile layering piece that's perfect for windy days. Featuring a water-resistant shell and adjustable hood, this jacket offers protection from the elements without sacrificing breathability. The iconic chevron design and color-blocking add a retro-inspired look, while the adjustable hem and cuffs ensure a customized fit. Whether you're hitting the trails or running errands, the Nike Windrunner Jacket is sure to keep you comfortable and stylish.",
    "size": {
      "S": 15,
      "M": 20,
      "L": 18,
      "XL": 12
    }
  },
  {
    "id": 14,
    "name": "Adidas NMD R1",
    "description": "Modern sneakers with boost technology.",
    "image": "../src/assets/products/Adidas NMD R1.avif",
    "category": "Sneakers",
    "brand": "Adidas",
    "retailPrice": 150,
    "price": 120,
    "recentlySold": 40,
    "color": "White",
    "releaseDate": "2023",
    "fullDescription": "The Adidas NMD R1 sneakers are a modern classic that combine style and performance in equal measure. Featuring Adidas' innovative Boost technology in the sole, these shoes offer responsive cushioning and energy return with every step. The sock-like construction and Primeknit upper provide a snug and supportive fit, while the iconic three stripes add a touch of sporty style. Whether you're hitting the streets or exploring the city, the Adidas NMD R1 is sure to turn heads wherever you go.",
    "size": {
      "6": 10,
      "7": 15,
      "8": 20,
      "9": 18,
      "10": 12,
      "11": 8
    }
  },
  {
    "id": 15,
    "name": "Gucci Ace Sneakers",
    "description": "Leather sneakers with embroidered details.",
    "image": "../src/assets/products/Gucci Ace Sneakers.avif",
    "category": "Sneakers",
    "brand": "Gucci",
    "retailPrice": 700,
    "price": 650,
    "recentlySold": 250,
    "color": "White",
    "releaseDate": "2020",
    "fullDescription": "The Gucci Ace Sneakers are a luxurious take on a classic silhouette. Crafted from smooth leather and adorned with embroidered details, these sneakers exude effortless style and sophistication. The iconic green and red Web stripes add a touch of Gucci's signature flair, while the metallic heel tab featuring the brand's bee motif adds a touch of whimsy. Whether paired with tailored trousers or jeans, the Gucci Ace Sneakers are sure to elevate any ensemble.",
    "size": {
      "6": 10,
      "7": 15,
      "8": 20,
      "9": 18,
      "10": 12,
      "11": 8
    }
  },
  {
    "id": 16,
    "name": "Nike Air Zoom Pegasus 38",
    "description": "Versatile running shoes.",
    "image": "../src/assets/products/Nike Air Zoom Pegasus 38.avif",
    "category": "Sneakers",
    "brand": "Nike",
    "retailPrice": 200,
    "price": 130,
    "recentlySold": 100,
    "color": "Black",
    "releaseDate": "2023",
    "fullDescription": "The Nike Air Zoom Pegasus 38 is a versatile running shoe designed to deliver comfort and performance for all distances. Featuring a responsive Zoom Air unit in the forefoot and cushioned foam midsole, these shoes provide a smooth and supportive ride from start to finish. The breathable mesh upper and padded collar offer a snug and comfortable fit, while the durable rubber outsole provides traction on a variety of surfaces. Whether you're logging miles on the road or hitting the trails, the Nike Air Zoom Pegasus 38 is the perfect choice for runners of all levels.",
    "size": {
      "6": 10,
      "7": 15,
      "8": 20,
      "9": 18,
      "10": 12,
      "11": 8
    }
  },
  {
    "id": 17,
    "name": "Adidas Essentials 3-Stripes Pants",
    "description": "Casual pants with signature 3-stripes.",
    "image": "../src/assets/products/adidas-Essentials-3-Stripes-Pants-Black-White.avif",
    "category": "Apparel",
    "brand": "Adidas",
    "retailPrice": 100,
    "price": 60,
    "recentlySold": 500,
    "color": "Black",
    "releaseDate": "2020",
    "fullDescription": "The Adidas Essentials 3-Stripes Pants are a versatile addition to any wardrobe. Made from soft and durable cotton-blend fabric, these pants offer comfort and style for everyday wear. The elastic waistband with drawcord provides a customizable fit, while the signature three stripes down the sides add a sporty touch. Whether you're hitting the gym or lounging at home, these pants are sure to become your new go-to.",
    "size": {
      "S": 15,
      "M": 20,
      "L": 18,
      "XL": 12
    }
  },
  {
    "id": 18,
    "name": "Versace Medusa Logo T-shirt",
    "description": "Luxurious tee featuring Versace Medusa.",
    "image": "../src/assets/products/Kith-x-Versace-Medusa-Tee-Black.avif",
    "category": "Apparel",
    "brand": "Versace",
    "retailPrice": 300,
    "price": 300,
    "recentlySold": 30,
    "color": "Black",
    "releaseDate": "2021",
    "fullDescription": "The Versace Medusa Logo T-shirt is a luxurious take on a classic wardrobe staple. Crafted from premium cotton jersey, this tee features the iconic Versace Medusa logo emblazoned across the chest, making a bold statement wherever you go. The crew neck and short sleeves offer a comfortable and relaxed fit, perfect for pairing with jeans or tailored trousers. Whether worn on its own or layered under a blazer, the Versace Medusa Logo T-shirt is sure to elevate your look with its unmistakable elegance.",
    "size": {
      "S": 15,
      "M": 20,
      "L": 18,
      "XL": 12
    }
  },
  {
    "id": 19,
    "name": "Nike Air Jordan 1",
    "description": "Legendary high-top sneakers.",
    "image": "../src/assets/products/Nike Air Jordan 1.avif",
    "category": "Sneakers",
    "brand": "Nike",
    "retailPrice": 200,
    "price": 170,
    "recentlySold": 60,
    "color": "Red",
    "releaseDate": "2023",
    "fullDescription": "The Nike Air Jordan 1 is a legendary silhouette that has transcended its basketball roots to become a cultural icon. Originally released in 1985, these high-top sneakers were designed for basketball superstar Michael Jordan and have since become one of the most coveted shoes in sneaker history. Featuring a premium leather upper and Air cushioning in the sole, the Air Jordan 1 offers both style and performance. The iconic 'Wings' logo and Nike Swoosh add a touch of branding, while the bold red colorway makes a statement on and off the court. Whether you're a sneakerhead or a basketball fan, the Nike Air Jordan 1 is a must-have addition to your collection.",
    "size": {
      "6": 10,
      "7": 15,
      "8": 20,
      "9": 18,
      "10": 12,
      "11": 8
    }
  },
  {
    "id": 20,
    "name": "Adidas Originals Trefoil Hoodie",
    "description": "Cozy hoodie with adidas Trefoil.",
    "image": "../src/assets/products/Gucci-x-adidas-Wool-Sweatshirt-Dark-Blue.avif",
    "category": "Apparel",
    "brand": "Adidas",
    "retailPrice": 100,
    "price": 70,
    "recentlySold": 100,
    "color": "Blue",
    "releaseDate": "2023",
    "fullDescription": "The Adidas Originals Trefoil Hoodie is a classic wardrobe staple that combines comfort and style. Made from soft and cozy cotton-blend fabric, this hoodie features the iconic Adidas Trefoil logo embroidered on the chest, adding a touch of sporty flair. The drawstring hood and kangaroo pocket offer added warmth and functionality, making it perfect for layering on chilly days. Whether paired with jeans or sweatpants, the Adidas Trefoil Hoodie is sure to keep you looking and feeling your best.",
    "size": {
      "S": 15,
      "M": 20,
      "L": 18,
      "XL": 12
    }
  },
  {
    "id": 21,
    "name": "Gucci Double G Buckle Belt",
    "description": "Signature belt with double G buckle.",
    "image": "../src/assets/products/Gucci-Double-G-Brass-Buckle-Leather-Belt-1-Width-Black.avif",
    "category": "Accessories",
    "brand": "Gucci",
    "retailPrice": 400,
    "price": 550,
    "recentlySold": 50,
    "color": "Black",
    "releaseDate": "2023",
    "fullDescription": "The Gucci Double G Buckle Belt is a timeless accessory that adds a touch of luxury to any outfit. Crafted from smooth leather and featuring the brand's iconic double G logo buckle, this belt exudes sophistication and style. Whether worn with jeans or tailored trousers, it adds a finishing touch to your look. Embrace the heritage and craftsmanship of Gucci with the Double G Buckle Belt and elevate your accessories game."
  },
  {
    "id": 22,
    "name": "Nike Air Max 97",
    "description": "Futuristic sneakers with Air cushioning.",
    "image": "../src/assets/products/Nike Air Max 97.avif",
    "category": "Sneakers",
    "brand": "Nike",
    "retailPrice": 200,
    "price": 160,
    "recentlySold": 30,
    "color": "Silver",
    "releaseDate": "2021",
    "fullDescription": "The Nike Air Max 97 is a futuristic silhouette that pushes the boundaries of design and technology. Featuring a sleek and streamlined upper with reflective detailing, these sneakers are sure to turn heads wherever you go. The full-length Air cushioning in the sole provides lightweight and responsive comfort with every step, while the rubber outsole offers traction and durability. Whether you're hitting the streets or stepping out for a night on the town, the Nike Air Max 97 is the perfect choice for style-conscious individuals.",
    "size": {
      "6": 10,
      "7": 15,
      "8": 20,
      "9": 18,
      "10": 12,
      "11": 8
    }
  },
  {
    "id": 23,
    "name": "Adidas Adilette Slides",
    "description": "Classic slides for laid-back style.",
    "image": "../src/assets/products/adidas-Adilette-22-Slides-Dark-Blue.avif",
    "category": "Sneakers",
    "brand": "Adidas",
    "retailPrice": 200,
    "price": 30,
    "recentlySold": 500,
    "color": "Blue",
    "releaseDate": "2021",
    "fullDescription": "The Adidas Adilette Slides are a classic sandal that offers laid-back style and all-day comfort. Featuring a contoured footbed and soft synthetic strap, these slides provide a snug and supportive fit. The iconic three stripes add a touch of sporty flair, while the lightweight construction makes them perfect for wearing poolside or around the house. Whether you're relaxing at home or heading to the beach, the Adidas Adilette Slides are the perfect choice for effortless summer style.",
    "size": {
      "6": 10,
      "7": 15,
      "8": 20,
      "9": 18,
      "10": 12,
      "11": 8
    }
  },
  {
    "id": 24,
    "name": "Louis Vuitton Monogram Wallet",
    "description": "Luxurious wallet with LV monogram print.",
    "image": "../src/assets/products/Louis-Vuitton-Multiple-Wallet-Monogram-Brown-Studio-1.avif",
    "category": "Accessories",
    "brand": "Louis Vuitton",
    "retailPrice": 600,
    "price": 700,
    "recentlySold": 15,
    "color": "Brown",
    "releaseDate": "2023",
    "fullDescription": "The Louis Vuitton Monogram Wallet is a luxurious accessory that combines style and functionality in equal measure. Crafted from the brand's iconic Monogram canvas with leather trim, this wallet exudes timeless elegance. The compact design features multiple card slots, a bill compartment, and a coin pocket, making it perfect for keeping your essentials organized. Whether tucked into your pocket or carried in your bag, the Louis Vuitton Monogram Wallet is sure to make a statement of sophistication."
  },
  {
    "id": 25,
    "name": "Nike ACG Cargo Pants",
    "description": "Durable cargo pants for outdoor adventures.",
    "image": "../src/assets/products/Nike-ACG-Smith-Summit-Cargo-Pants-Green.avif",
    "category": "Apparel",
    "brand": "Nike",
    "retailPrice": 120,
    "price": 140,
    "recentlySold": 70,
    "color": "Green",
    "releaseDate": "2023",
    "fullDescription": "The Nike ACG Cargo Pants are designed for outdoor enthusiasts who demand performance and durability. Made from tough ripstop fabric with reinforced knees and seat, these pants can withstand rugged terrain and harsh conditions. The multiple pockets offer plenty of storage for your essentials, while the adjustable waistband ensures a secure and comfortable fit. Whether you're hiking, camping, or exploring the urban jungle, the Nike ACG Cargo Pants are ready for any adventure.",
    "size": {
      "S": 15,
      "M": 20,
      "L": 18,
      "XL": 12
    }
  },
  {
    "id": 26,
    "name": "Adidas Ultraboost 21",
    "description": "Running shoes with Boost.",
    "image": "../src/assets/products/Adidas Ultraboost 21.avif",
    "category": "Sneakers",
    "brand": "Adidas",
    "retailPrice": 150,
    "price": 180,
    "recentlySold": 140,
    "color": "Gray",
    "releaseDate": "2023",
    "fullDescription": "The Adidas Ultraboost 21 is the ultimate running shoe for athletes who demand maximum performance and comfort. Featuring Adidas' innovative Boost cushioning in the sole, these shoes provide responsive energy return with every step, helping you to run faster and farther than ever before. The Primeknit upper offers a snug and supportive fit, while the Stretchweb outsole provides exceptional traction on a variety of surfaces. Whether you're training for a marathon or logging miles on the treadmill, the Adidas Ultraboost 21 is sure to take your running game to the next level.",
    "size": {
      "6": 10,
      "7": 15,
      "8": 20,
      "9": 18,
      "10": 12,
      "11": 8
    }
  },
  {
    "id": 27,
    "name": "Gucci Oversized Sunglasses",
    "description": "Statement sunglasses with oversized frames.",
    "image": "../src/assets/products/Gucci-Oversized-Sheild-Sunglasses-Black-Gold-GG1255S-001.avif",
    "category": "Accessories",
    "brand": "Gucci",
    "retailPrice": 400,
    "price": 400,
    "recentlySold": 30,
    "color": "Black",
    "releaseDate": "2021",
    "fullDescription": "The Gucci Oversized Sunglasses are a statement accessory that exudes luxury and sophistication. Featuring oversized frames and tinted lenses, these sunglasses offer both style and protection from the sun's rays. The iconic interlocking GG logo adorns the temples, adding a touch of branding to the design. Whether worn poolside or strolling through the city streets, the Gucci Oversized Sunglasses are sure to turn heads and elevate your look."
  },
  {
    "id": 28,
    "name": "Nike Sportswear Club Fleece Sweatshirt",
    "description": "Cozy sweatshirt.",
    "image": "../src/assets/products/Nike-Sportswear-Club-Fleece-Hoodie-Grey.avif",
    "category": "Apparel",
    "brand": "Nike",
    "retailPrice": 60,
    "price": 60,
    "recentlySold": 200,
    "color": "Gray",
    "releaseDate": "2021",
    "fullDescription": "The Nike Sportswear Club Fleece Sweatshirt is a classic wardrobe staple that offers cozy comfort and timeless style. Made from soft and plush fleece fabric, this sweatshirt features a crew neck and ribbed cuffs for a snug and comfortable fit. The Nike logo embroidered on the chest adds a touch of sporty flair, while the relaxed silhouette makes it perfect for layering over your favorite tee. Whether lounging at home or running errands, the Nike Club Fleece Sweatshirt is sure to become your new go-to.",
    "size": {
      "S": 15,
      "M": 20,
      "L": 18,
      "XL": 12
    }
  },
  {
    "id": 29,
    "name": "Adidas Originals Continental 80",
    "description": "Vintage sneakers.",
    "image": "../src/assets/products/Adidas Originals Continental 80.avif",
    "category": "Sneakers",
    "brand": "Adidas",
    "retailPrice": 100,
    "price": 90,
    "recentlySold": 200,
    "color": "White",
    "releaseDate": "2023",
    "fullDescription": "The Adidas Originals Continental 80 sneakers are a retro-inspired silhouette that pays homage to the brand's rich heritage. Featuring a minimalist design with a perforated toe box and swooping side stripe, these shoes exude vintage charm and timeless style. The plush leather upper and cushioned midsole provide all-day comfort, while the low-profile silhouette adds a touch of understated elegance. Whether paired with jeans or shorts, the Adidas Continental 80 is sure to make a statement wherever you go.",
    "size": {
      "6": 10,
      "7": 15,
      "8": 20,
      "9": 18,
      "10": 12,
      "11": 8
    }
  },
  {
    "id": 30,
    "name": "Prada Nylon Crossbody Bag",
    "description": "Crossbody bag crafted from nylon.",
    "image": "../src/assets/products/Prada-Crossbody-Bag-Nylon-Black.avif",
    "category": "Accessories",
    "brand": "Prada",
    "retailPrice": 800,
    "price": 850,
    "recentlySold": 30,
    "color": "Black",
    "releaseDate": "2023",
    "fullDescription": "The Prada Nylon Crossbody Bag is a chic and versatile accessory that's perfect for everyday wear. Crafted from durable nylon with leather trim, this bag features a compact silhouette with multiple pockets for keeping your essentials organized. The adjustable crossbody strap allows for hands-free carrying, while the iconic Prada logo plaque adds a touch of luxury. Whether running errands or heading out for the evening, the Prada Nylon Crossbody Bag is sure to elevate your look with its understated elegance."
  },
  {
    "id": 31,
    "name": "Air Jordan Mocha",
    "description": "Classic sneakers from Nike.",
    "image": "../src/assets/products/Air Jordan Mocha.avif",
    "category": "Sneakers",
    "brand": "Nike",
    "retailPrice": 200,
    "price": 150,
    "recentlySold": 100,
    "color": "Brown",
    "releaseDate": "2023",
    "fullDescription": "The Air Jordan Mocha sneakers are a classic silhouette that pays homage to the brand's rich heritage and iconic designs. Featuring a premium leather upper and signature Air cushioning in the sole, these shoes offer both style and performance. The timeless colorway and clean lines make them perfect for pairing with any outfit, while the iconic Jumpman logo adds a touch of sporty flair. Whether you're hitting the court or hitting the streets, the Air Jordan Mocha is sure to make a statement.",
    "size": {
      "6": 10,
      "7": 15,
      "8": 20,
      "9": 18,
      "10": 12,
      "11": 8
    }
  },
  {
    "id": 32,
    "name": "Adidas Ultraboost",
    "description": "Comfortable running shoes.",
    "image": "../src/assets/products/Adidas Ultraboost.avif",
    "category": "Sneakers",
    "brand": "Adidas",
    "retailPrice": 150,
    "price": 120,
    "recentlySold": 90,
    "color": "White",
    "releaseDate": "2023",
    "fullDescription": "The Adidas Ultraboost sneakers are designed for runners who demand maximum comfort and performance. Featuring Adidas' innovative Boost cushioning in the sole, these shoes provide responsive energy return with every step, helping you to run faster and farther than ever before. The Primeknit upper offers a snug and supportive fit, while the Stretchweb outsole provides exceptional traction on a variety of surfaces. Whether you're hitting the track or logging miles on the treadmill, the Adidas Ultraboost is sure to take your running game to the next level.",
    "size": {
      "6": 10,
      "7": 15,
      "8": 20,
      "9": 18,
      "10": 12,
      "11": 8
    }
  },
  {
    "id": 33,
    "name": "Nike Tech Fleece Hoodie",
    "description": "Warm and stylish hoodie.",
    "image": "../src/assets/products/Nike-Tech-Fleece-Full-Zip-Hoodie-Black-v3.avif",
    "category": "Apparel",
    "brand": "Nike",
    "retailPrice": 90,
    "price": 80,
    "recentlySold": 200,
    "color": "Black",
    "releaseDate": "2021",
    "fullDescription": "The Nike Tech Fleece Hoodie is a stylish and versatile layering piece that's perfect for cooler weather. Made from soft and lightweight Tech Fleece fabric, this hoodie offers warmth and comfort without the bulk, making it perfect for everyday wear. The adjustable hood and ribbed cuffs provide a snug fit, while the zippered pockets offer secure storage for your essentials. Whether paired with jeans or joggers, the Nike Tech Fleece Hoodie is sure to keep you looking and feeling your best.",
    "size": {
      "S": 15,
      "M": 20,
      "L": 18,
      "XL": 12
    }
  },
  {
    "id": 34,
    "name": "Gucci Dionysus Mini Bag",
    "description": "Luxurious bag with signature tiger head.",
    "image": "../src/assets/products/Gucci-Dionysus-Leather-Shoulder-Bag-Super-Mini-Black.avif",
    "category": "Accessories",
    "brand": "Gucci",
    "retailPrice": 1200,
    "price": 1500,
    "recentlySold": 10,
    "color": "Black",
    "releaseDate": "2022",
    "fullDescription": "The Gucci Dionysus Mini Bag is a luxurious accessory that adds instant sophistication to any outfit. Crafted from smooth leather and featuring the brand's signature tiger head closure, this mini bag exudes timeless elegance. The compact design features a chain strap that can be worn crossbody or doubled for a shorter length, while the interior pocket offers storage for your essentials. Whether paired with eveningwear or dressed down with jeans and a tee, the Gucci Dionysus Mini Bag is sure to make a statement."
  }
]
